Revit 2024 API
SketchPlane.GetPlaneReference Method
 Returns a reference to this element as a plane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public Reference GetPlaneReference()
Visual Basic
Public Function GetPlaneReference As Reference
Visual C++
public:
Reference^ GetPlaneReference()
Return Value
 The reference.
Remarks
 The object returned here can be used with the PointOnPlane class.
See Also
SketchPlane Class
Autodesk.Revit.DB Namespace